{"id":"cfcad69e-0972-4d09-b6e3-79cac42f5e9e","rule_id":"9ff8cb6b-cb25-476e-bc74-6e7a84267e0f","name":"SSH Bruteforce Attempt","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":5,"updated_at":"2026-06-30T00:31:25.967Z","updated_by":"elastic","created_at":"2026-06-13T22:16:30.523Z","created_by":"elastic","enabled":true,"interval":"1m","from":"now-6m","to":"now","description":"This rule detects failed account auth towards user: root via SSH","tags":[],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[{"name":"user.name","type":"keyword","ecs":true},{"name":"source.ip","type":"ip","ecs":true}],"setup":"","false_positives":[],"references":[],"risk_score":51,"risk_score_mapping":[],"severity":"medium","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"meta":{"kibana_siem_app_url":"http://<SOC-IP>:5601/app/security"},"type":"threshold","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"system.auth.ssh.event : * and agent.name : \"Linux-Ubuntu24-ssh\" and system.auth.ssh.event : \"Failed\" and user.name : \"root\"  ","filters":[],"threshold":{"field":["user.name","source.ip"],"value":5,"cardinality":[]}}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
