{"id":"bcbbcbfe-f96f-4dd8-8c71-51be083e1c60","rule_id":"dd917df6-b876-4c4b-8199-b0b143e9279b","name":"RDP Bruteforce Attempt","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":1,"updated_at":"2026-06-30T00:32:42.982Z","updated_by":"elastic","created_at":"2026-06-13T22:21:52.602Z","created_by":"elastic","enabled":true,"interval":"1m","from":"now-6m","to":"now","description":"This rule detects failed auth attempts towards user: Administrator","tags":[],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[{"name":"source.ip","type":"ip","ecs":true},{"name":"user.name","type":"keyword","ecs":true}],"setup":"","false_positives":[],"references":[],"risk_score":47,"risk_score_mapping":[],"severity":"medium","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"meta":{"kibana_siem_app_url":"http://<SOC-IP>:5601/app/security"},"type":"threshold","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code : 4625 and agent.name :\"Win10-2022-SOC\" and user.name : \"Administrator\" ","filters":[],"threshold":{"field":["user.name","source.ip"],"value":5,"cardinality":[]}}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
